"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG

"""
# for i(變量符號) in range(次數起始, 次數結束(此數字不被包含))
for i in range(1, 101):
    print('hello world')
print('goodbye world')

# ===============================
# 下面是指從1開始到11結束每增加3顯示一次，所以一共會顯示1, 4, 7, 10
for i in range(1, 11, 3):
    print(i)

# ===============================
#以下程序題目: 建設一道程序，可表達整數1至100連續相加之和
total = 0
for i in range(1, 101):
    #total = total + i 相當於 total += i
    total += i
    print(i, total)

# ===============================
#以下程序題目: 建設一道程序，可表達整數1至100連續奇數相加之和
#for i in range(1, 101, 2): 其中括號部分(1[範圍下限寫包含], 101[範圍上限但不包含], 2[差值])
total = 0
for i in range(1, 101, 2):
    #total = total + i 相當於 total += i
    total += i
    print(i, total)

# ===============================
#以下程序題目: 建設一道程序，可表達整數1至100連續偶數相加之和
total = 0
for i in range(2, 101, 2):
    #total = total + i 相當於 total += i
    total += i
    print(i, total)

# ===============================
#以下程序題目: 建設一道程序，可表達整數1至100連續偶數相加之和，利用sum表達更簡單語法
print(sum(range(5, 101, 5)))

# ===============================
#以下程序題目: 建設一道程序，可表達整數1至100區間3或5的倍數相加之和，利用sum表達更簡單語法
#寫法一:
x = sum(range(3, 101, 3))
y = sum(range(5, 101, 5))
z = sum(range(15, 100, 15))
print(x, y, z, x + y - z)

# ===============================
#寫法二:
c = 0
d = 0
e = 0
for i in range(1, 101):
    if i % 5 == 0:
        c += i
    elif i % 3 == 0:
        d += i
print(c, d, c + d)
