"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG
#以下這兩種寫法可以看看差異在哪
其實就是第一種只能做讀取使用，只單獨做讀取操作時兩種都沒差
第二種則可以同時做為讀取寫入使用(比較好)
"""
nums = [12, 16, 20, 62, 89]
#第一種
# for i in nums:
#     print(i) #這種寫法就無法表達順序數是第幾個
#     i = 100 這行實際上無法執行成抽換i 為100
# print(nums)

#第二種
for k in range(len(nums)):
    print('這是第', k, nums[k]) #這種寫法還可以表達每個值編號是列表第幾個
    nums[k] = 100 #這種寫法可以把nums裡面內容全部寫入新的值100
print(nums)

#enumerate函數: 枚舉法可以把第一種方法額外做列表
for i, k in enumerate(nums):
    print(i + 1, k)