"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG


#判斷一個數字是否為質數
#num = x(正整數) ** y(次方數) - z(調整數)
"""

x = int(input('請輸入一個正整數'))
y = int(input('請輸入x次方數'))
z = int(input('調整數'))
num = x ** y - z
x = True
for i in range(num-1, 1, -1):
    if num % i == 0:
        x = False
        break
if num > 1 and x:
    print(num, '這是一個質數')
elif num == 1:
    print('1既非質數也非和數, 1就是1')
else:
    print(num, '最大公因數', i, '故這不是質數')
