"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG
主題: 容器型數據類型(用一個變量可表達多個數)
1. list 列表 ---> nums = [10, 100, 1000 ] 這就是一個列表，通常命名要加s表示複數，是慣例，如nums
2. tuple 元組
3. set 集合
4. dictionary 字典

insert 加入(可指定位置)
append 追加(加入到尾端)
pop 刪除最後一個元素
"""

nums = [10, 100, 1000 ]
print(type(nums), nums) #type是可以表示數據類型

rules = ['禮運大同', '三民主義',
         '大道至簡', '相由心生'] #可以換行寫不影響運行，但比較美觀
print(type(rules), rules)