"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG

"""
#找出從某個範圍內所有質數
k = int(input('請輸入一個正整數'))
while k == 1:
    print('1既非質數也非和數, 1就是1')
    break
while k == 2:
    print('在1到', k, '共有質數', end=(''))
    print('範圍內有質數2')
    break
while k > 2:
    print('在1到', k, '共有質數', end=(''))
    for num in range(2, k + 1):
        x = True
        for i in range(2, num):
            if num % i == 0:
                x = False
                break
        if x:
            print( num, end=',')
    break
