"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG

"""
#f = format格式化，上次介紹%f佔位符號寫法比較複雜，python 3.6之後有更新的寫法就是利用format方法
#如果要限制計算結果小數點後位數表達，如只想表達小數點後2位，寫成下面
#print(f'{x} - {y} = {x - y:.2f}')

x = float(input("請輸入x值="))
y = float(input("請輸入y值="))
print(f'{x} + {y} = {x + y:.3f}')
print(f'{x} - {y} = {x - y:.2f}')
print(f'{x} * {y} = {x * y:.4f}')
print(f'{x} / {y} = {x / y:.2f}')
print(f'{x} // {y} = {x // y:.5f}')
print(f'{x} % {y} = {x % y:.5f}')
print(f'{x} ** {y} = {x ** y:.2f}')
