"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG

"""

# float浮點數的坑，0.1 + 0.2 不等於0.3，會等於0.30000000000000004，這樣結果很神奇吧
# float在任和語言中都有這樣問題，再舉個例子0.1 + 0.2 + 0.3竟不等於0.3 + 0.2 +0.1
print(0.1 + 0.2)
print(100 / 6)

# 所以建議能用整數運算就不要用浮點數(float)，除非不得已運算過程中牽涉有float
# 非使用float時候建議需要指定程序顯示其中一部分小數點(有計算意義即可)
# 如果是float則使用%f當作佔位符號，如果是int則使用%d當作佔位符號
# 在float佔位符號寫作%f，如果只想要讓它顯示小數點後一位則寫成%.1f，如果想要顯示小數點後三位則%.3f
x1 = 123.4
y2 = 45.6
print('%.1f + %.1f = %.1f' % (x1, y2, x1 + y2))
print('%.2f - %.2f = %.2f' % (x1, y2, x1 - y2))
print('%.1f * %.1f = %.1f' % (x1, y2, x1 * y2))
print('%f / %f = %f' % (x1, y2, x1 / y2))
print('%f // %f = %f' % (x1, y2, x1 // y2))
print('%f %% %f = %f' % (x1, y2, x1 % y2))
print('%f ** %f = %f' % (x1, y2, x1 ** y2))
print('%f %% %f = %f' % (x1, y2, x1 % y2))
