"""
Python 課程
Author: PY
Date: 2022/02/09
Location: 板橋

//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//               佛祖保佑         永無BUG
#運算符號: 優先性以及結合性
左結合: 從左往右(多數運算)
右結合: 從右往左(賦值運算, []索引, [:]切片)
寫一個程序，有一顆骰子，給定擲骰子次數，求骰子結果分布
"""
import random

f1 = f2 = f3 = f4 = f5 = f6 = 0
x = int(input('輸入要擲骰子次數'))
for _ in range(x):
    y = random.randrange(1, 7)
    if y == 1:
        f1 += 1
    elif y == 2:
        f2 += 1
    elif y == 3:
        f3 += 1
    elif y == 4:
        f4 += 1
    elif y == 5:
        f5 += 1
    elif y == 6:
        f6 += 1
print(f'點數1出現了{f1}次')
print(f'點數2出現了{f2}次')
print(f'點數3出現了{f3}次')
print(f'點數4出現了{f4}次')
print(f'點數5出現了{f5}次')
print(f'點數6出現了{f6}次')